#ifndef SYSTICK_H_
#define SYSTICK_H_

#include <stdint.h>
#include "gd32f30x.h"

/**
***********************************************************
* @brief systick初始化
* @param
* @return 
***********************************************************
*/
void SystickInit(void);
/**
***********************************************************
* @brief 定时器中断服务函数
* @param
* @return 
***********************************************************
*/
void SysTick_Handler(void);
/**
***********************************************************
* @brief 获取系统运行时间
* @param
* @return 以1ms为单位
***********************************************************
*/
uint64_t GetSysRunTime(void);

#endif
