#ifndef USB_DRV_H_
#define USB_DRV_H_

#include <stdint.h>
#include "gd32f30x.h"

/**
***********************************************************
* @brief USB转串口硬件初始化
* @param
* @return 
***********************************************************
*/
void UsbDrvInit(void);

/**
***********************************************************
* @brief 串口0中断服务函数
* @param
* @return 
***********************************************************
*/
void USART0_IRQHandler(void);


/**
***********************************************************
* @brief 注册回调服务函数
* @param pFunc回调地址
* @return 
***********************************************************
*/
void regUsb2ComCb (void(*pFunc)(uint8_t data));

#endif
